{
  "title": "My Projects",
  "subtitle": "Here’s a collection of my personal learning projects and professional works built using various modern technologies.",
  "personal": [
    {
      "id": 1,
      "year": 2020,
      "link": "https://hakthonpro.vercel.app/",
      "proname": "E-commerce Website",
      "techname": "Next.js, Redux",
      "discription": "Developed a complete e-commerce web application during my learning phase, allowing users to browse products, view details, and manage their carts seamlessly. Implemented Redux for global state management to handle product data and user sessions efficiently. Focused on creating a responsive, performance-optimized user interface with dynamic routing, product filtering, and cart management. This project strengthened my understanding of scalable frontend structures, asynchronous data handling, and overall e-commerce workflows."
    },
    {
      "id": 2,
      "year": 2020,
      "link": "https://socailmediaapp.vercel.app/",
      "proname": "Social Media App",
      "techname": "React, Node.js, MongoDB",
      "discription": "Built a complete social networking platform to explore full-stack development concepts. Integrated features such as post creation, likes, comments, and authentication. Users can connect, share updates, and interact in real time. Implemented RESTful APIs with Node.js and MongoDB for backend management and used React for dynamic UI rendering. The project improved my understanding of real-time communication, secure authentication, and the relationship between frontend and backend architectures."
    },
    {
      "id": 3,
      "year": 2021,
      "link": "https://quizapp-ruby-three.vercel.app/",
      "proname": "Quiz Application",
      "techname": "React, TypeScript",
      "discription": "Developed an interactive quiz application to enhance my understanding of React hooks and TypeScript. Users can select categories, attempt timed quizzes, and view their scores upon completion. Focused on reusable components, state management, and conditional rendering to create a dynamic user experience. This project helped me strengthen my TypeScript fundamentals, component reusability, and user interaction handling in modern frontend development."
    },
    {
      "id": 4,
      "year": 2021,
      "link": "https://photogalleryui.vercel.app/",
      "proname": "Photo Gallery",
      "techname": "MERN Stack",
      "discription": "Created a photo gallery web application where users can upload, categorize, and manage their images privately or publicly. The project features a clean and responsive layout, efficient image rendering, and cloud-based data handling. Developed CRUD functionalities with MongoDB and Express, while using React for dynamic UI updates. This project enhanced my understanding of data storage strategies, user privacy handling, and performance optimization for media-heavy web applications."
    },
    {
      "id": 5,
      "year": 2020,
      "link": "https://fullauthrized-crud.vercel.app/",
      "proname": "Full Authorized CRUD",
      "techname": "Next.js, Express, MongoDB",
      "discription": "Developed a fully functional CRUD application with complete authentication and authorization. Integrated a password recovery feature using secure 6-digit OTP verification via email. Users can register, log in, and manage data with role-based access controls. The backend handles secure API routes with JWT, and the frontend is built for smooth UX and validation. This project taught me advanced authentication flows and backend security principles, simulating real-world production-level systems."
    },
    {
      "id": 6,
      "year": 2021,
      "link": "https://contact-list-bice-zeta.vercel.app/",
      "proname": "Contact List",
      "techname": "Next.js, Redux, Express",
      "discription": "Developed a contact management system that enables users to add, edit, delete, and search contact details in an organized interface. Used Redux for efficient state management and Express for backend data handling. The system features responsive UI design and error handling for form validation. This project helped me build confidence in handling CRUD operations, state persistence, and UI performance optimization using modern React workflows."
    },
    {
      "id": 7,
      "year": 2021,
      "link": "https://jobseekerfrontend.vercel.app",
      "proname": "Job Seeker",
      "techname": "MERN Stack",
      "discription": "Built a functional job portal that connects job seekers and employers, featuring authentication, job posting, and application tracking. Implemented search filters, profile management, and dynamic dashboards for both user types. Focused on scalability, secure login sessions, and responsive layouts. This project simulated a real-world HR recruitment environment and helped me practice structuring a multi-role system with clean database design and modular React components."
    },
    {
      "id": 8,
      "year": 2020,
      "link": "https://adnanyousafzai21.github.io/Todo_List/",
      "proname": "ToDo List",
      "techname": "React, Express",
      "discription": "Developed a simple yet interactive to-do application to master React fundamentals such as hooks, state management, and component-based architecture. Users can add, edit, mark as complete, and delete tasks with persistent state handling. Integrated Express for simple backend operations and deployed the app to practice deployment workflows. This foundational project laid the groundwork for understanding how frontend and backend logic interact in real applications."
    }
  ],
  "professional": [
    {
      "id": 1,
      "year": 2022,
      "proname": "Madrasa – Education Management Web App",
      "techname": "MERN Stack",
      "discription": "Worked with a team to develop Madrasa, an education management platform using the MERN stack. Built Admin, Teacher, and Student portals with pages for classes, departments, settings, notifications, chat, results, schedules, and fee management.",
      "link": "restricted",
      "organization": "Decotechs"
    },
    {
      "id": 2,
      "year": 2023,
      "proname": "Time Tracking Application with Real-Time Data",
      "techname": "React, Electron, Firebase",
      "discription": "Developed a robust time tracking application using React, Electron, and Firebase, enabling real-time session management, automated screenshot capture, and geolocation tracking.",
      "link": "restricted",
      "organization": "Decotechs"
    },
    {
      "id": 3,
      "year": 2023,
      "proname": "Pertime – HR and Organization Management",
      "techname": "MERN Stack",
      "discription": "Independently developed PERTIME, an HR and organization management web app with Admin and User dashboards. Designed and built pages for employees, leave, reports, complaints, and settings.",
      "link": "restricted",
      "organization": "Expertizo"
    },
    {
      "id": 4,
      "year": 2024,
      "proname": "Crypto Platform Frontend Development",
      "techname": "Next.js, Blockchain APIs",
      "discription": "Worked with a blockchain team as a Frontend Developer, building responsive crypto websites and dashboards. Integrated wallet connections, blockchain APIs, and real-time data displays.",
      "link": "restricted",
      "organization": "Expertizo"
    },
    {
      "id": 5,
      "year": 2025,
      "proname": "Chat Support Application",
      "techname": "React, Firebase",
      "discription": "Developed a real-time chat and customer support web application for internal organization use.",
      "link": "restricted",
      "organization": "Expertizo"
    }
  ]
}
